AOG-addendum/esp32-autosteer/src/main.cpp
  // Sensors Tab
  {
    uint16_t tab = ESPUI.addControl( ControlType::Tab, "Sensors", "Sensors" );

    {
      uint16_t sel = ESPUI.addControl( ControlType::Select, "I2C SDA Gpio*", String( ( int )steerConfig.gpioSDA ), ControlColor::Wetasphalt, tab,
      []( Control * control, int id ) {
        steerConfig.gpioSDA = ( SteerConfig::Gpio )control->value.toInt();
        setResetButtonToRed();
      } );
      ESPUI.addControl( ControlType::Option, "Board Default", "-1", ControlColor::Alizarin, sel );
      addGpioOutput( sel );
    }
    {
      uint16_t sel = ESPUI.addControl( ControlType::Select, "I2C SCL Gpio*", String( ( int )steerConfig.gpioSCL ), ControlColor::Wetasphalt, tab,
      []( Control * control, int id ) {
        steerConfig.gpioSCL = ( SteerConfig::Gpio )control->value.toInt();
        setResetButtonToRed();
      } );
      ESPUI.addControl( ControlType::Option, "Board Default", "-1", ControlColor::Alizarin, sel );
      addGpioOutput( sel );
    }
    {
      uint16_t num = ESPUI.addControl( ControlType::Number, "I2C Bus Speed*", String( steerConfig.i2cBusSpeed ), ControlColor::Wetasphalt, tab,
      []( Control * control, int id ) {
        steerConfig.i2cBusSpeed = control->value.toInt();
      } );
      ESPUI.addControl( ControlType::Min, "Min", "10000", ControlColor::Peterriver, num );
      ESPUI.addControl( ControlType::Max, "Max", "5000000", ControlColor::Peterriver, num );
      ESPUI.addControl( ControlType::Step, "Step", "1000", ControlColor::Peterriver, num );
    }

  }

  // Safety Tab
  {
    uint16_t tab = ESPUI.addControl( ControlType::Tab, "Safety", "Safety" );

    {
      uint16_t num = ESPUI.addControl( ControlType::Number, "Max autosteer speed", String( steerConfig.maxAutosteerSpeed ), ControlColor::Peterriver, tab,
      []( Control * control, int id ) {
        steerConfig.maxAutosteerSpeed = control->value.toFloat();
      } );
      ESPUI.addControl( ControlType::Min, "Min", "0", ControlColor::Peterriver, num );
      ESPUI.addControl( ControlType::Max, "Max", "30", ControlColor::Peterriver, num );
      ESPUI.addControl( ControlType::Step, "Step", "0.5", ControlColor::Peterriver, num );
    }
    {
      uint16_t sel = ESPUI.addControl( ControlType::Select, "Output Pin for Alarm*", String( ( int )steerConfig.gpioAlarm ), ControlColor::Wetasphalt, tab,
      []( Control * control, int id ) {
        steerConfig.gpioAlarm = ( SteerConfig::Gpio )control->value.toInt();
        setResetButtonToRed();
      } );
      ESPUI.addControl( ControlType::Option, "None", "0", ControlColor::Alizarin, sel );
      addGpioOutput( sel );
    }
    {
      uint16_t sel = ESPUI.addControl( ControlType::Select, "Speed units", String( ( int )steerConfig.speedUnits ), ControlColor::Peterriver, tab,
      []( Control * control, int id ) {
        steerConfig.speedUnits =  ( SteerConfig::SpeedUnits )control->value.toInt();
      } );
      ESPUI.addControl( ControlType::Option, "MPH", "0", ControlColor::Alizarin, sel );
      ESPUI.addControl( ControlType::Option, "KPH", "1", ControlColor::Alizarin, sel );
    }
  }

  if( steerConfig.mode == SteerConfig::Mode::QtOpenGuidance ) {

    // Channels Tab
    {
      uint16_t tab = ESPUI.addControl( ControlType::Tab, "Channels", "Channels" );

      {
        uint16_t num = ESPUI.addControl( ControlType::Number, "Channel ID Autosteer Enable", String( steerConfig.qogChannelIdAutosteerEnable ), ControlColor::Peterriver, tab,
        []( Control * control, int id ) {
          steerConfig.qogChannelIdAutosteerEnable = control->value.toInt();
        } );
        ESPUI.addControl( ControlType::Min, "Min", "0", ControlColor::Peterriver, num );
        ESPUI.addControl( ControlType::Max, "Max", "65535", ControlColor::Peterriver, num );
        ESPUI.addControl( ControlType::Step, "Step", "1", ControlColor::Peterriver, num );
      }
      {
        uint16_t num = ESPUI.addControl( ControlType::Number, "Channel ID Workswitch", String( steerConfig.qogChannelIdWorkswitch ), ControlColor::Peterriver, tab,
        []( Control * control, int id ) {
          steerConfig.qogChannelIdWorkswitch = control->value.toInt();
        } );
        ESPUI.addControl( ControlType::Min, "Min", "0", ControlColor::Peterriver, num );
        ESPUI.addControl( ControlType::Max, "Max", "65535", ControlColor::Peterriver, num );
        ESPUI.addControl( ControlType::Step, "Step", "1", ControlColor::Peterriver, num );
      }
      {
        uint16_t num = ESPUI.addControl( ControlType::Number, "Channel ID Steerswitch", String( steerConfig.qogChannelIdSteerswitch ), ControlColor::Peterriver, tab,
        []( Control * control, int id ) {
          steerConfig.qogChannelIdWorkswitch = control->value.toInt();
        } );
        ESPUI.addControl( ControlType::Min, "Min", "0", ControlColor::Peterriver, num );
        ESPUI.addControl( ControlType::Max, "Max", "65535", ControlColor::Peterriver, num );
        ESPUI.addControl( ControlType::Step, "Step", "1", ControlColor::Peterriver, num );
      }

      {
        uint16_t num = ESPUI.addControl( ControlType::Number, "Channel ID Wheel Angle", String( steerConfig.qogChannelIdWheelAngle ), ControlColor::Peterriver, tab,
        []( Control * control, int id ) {
          steerConfig.qogChannelIdWheelAngle = control->value.toInt();
        } );
        ESPUI.addControl( ControlType::Min, "Min", "0", ControlColor::Peterriver, num );
        ESPUI.addControl( ControlType::Max, "Max", "65535", ControlColor::Peterriver, num );
        ESPUI.addControl( ControlType::Step, "Step", "1", ControlColor::Peterriver, num );
      }

      {
        uint16_t num = ESPUI.addControl( ControlType::Number, "Channel ID Steer Angle Setpoint", String( steerConfig.qogChannelIdSetpointSteerAngle ), ControlColor::Peterriver, tab,
        []( Control * control, int id ) {
          steerConfig.qogChannelIdSetpointSteerAngle = control->value.toInt();
        } );
        ESPUI.addControl( ControlType::Min, "Min", "0", ControlColor::Peterriver, num );
        ESPUI.addControl( ControlType::Max, "Max", "65535", ControlColor::Peterriver, num );
        ESPUI.addControl( ControlType::Step, "Step", "1", ControlColor::Peterriver, num );
      }

      {
        uint16_t num = ESPUI.addControl( ControlType::Number, "Channel ID Orientation", String( steerConfig.qogChannelIdOrientation ), ControlColor::Peterriver, tab,
        []( Control * control, int id ) {
          steerConfig.qogChannelIdOrientation = control->value.toInt();
        } );
        ESPUI.addControl( ControlType::Min, "Min", "0", ControlColor::Peterriver, num );
        ESPUI.addControl( ControlType::Max, "Max", "65535", ControlColor::Peterriver, num );
        ESPUI.addControl( ControlType::Step, "Step", "1", ControlColor::Peterriver, num );
      }

      {
        uint16_t num = ESPUI.addControl( ControlType::Number, "Channel ID GPS Data In", String( steerConfig.qogChannelIdGpsDataIn ), ControlColor::Peterriver, tab,
        []( Control * control, int id ) {
          steerConfig.qogChannelIdGpsDataIn = control->value.toInt();
        } );
        ESPUI.addControl( ControlType::Min, "Min", "0", ControlColor::Peterriver, num );
        ESPUI.addControl( ControlType::Max, "Max", "65535", ControlColor::Peterriver, num );
        ESPUI.addControl( ControlType::Step, "Step", "1", ControlColor::Peterriver, num );
      }
      {
        uint16_t num = ESPUI.addControl( ControlType::Number, "Channel ID GPS Data Out", String( steerConfig.qogChannelIdGpsDataOut ), ControlColor::Peterriver, tab,
        []( Control * control, int id ) {
          steerConfig.qogChannelIdGpsDataOut = control->value.toInt();
        } );
        ESPUI.addControl( ControlType::Min, "Min", "0", ControlColor::Peterriver, num );
        ESPUI.addControl( ControlType::Max, "Max", "65535", ControlColor::Peterriver, num );
        ESPUI.addControl( ControlType::Step, "Step", "1", ControlColor::Peterriver, num );
      }

      if( steerConfig.mode == SteerConfig::Mode::QtOpenGuidance && steerConfig.canBusEnabled ) {
        {
          uint16_t num = ESPUI.addControl( ControlType::Number, "Channel ID CAN: Rear Hitch", String( steerConfig.qogChannelIdCanRearHitch ), ControlColor::Peterriver, tab,
          []( Control * control, int id ) {
            steerConfig.qogChannelIdCanRearHitch = control->value.toInt();
          } );
          ESPUI.addControl( ControlType::Min, "Min", "0", ControlColor::Peterriver, num );
          ESPUI.addControl( ControlType::Max, "Max", "65535", ControlColor::Peterriver, num );
          ESPUI.addControl( ControlType::Step, "Step", "1", ControlColor::Peterriver, num );
        }
        {
          uint16_t num = ESPUI.addControl( ControlType::Number, "Channel ID CAN: Front Hitch", String( steerConfig.qogChannelIdCanFrontHitch ), ControlColor::Peterriver, tab,
          []( Control * control, int id ) {
            steerConfig.qogChannelIdCanFrontHitch = control->value.toInt();
          } );
          ESPUI.addControl( ControlType::Min, "Min", "0", ControlColor::Peterriver, num );
          ESPUI.addControl( ControlType::Max, "Max", "65535", ControlColor::Peterriver, num );
          ESPUI.addControl( ControlType::Step, "Step", "1", ControlColor::Peterriver, num );
        }
        {
          uint16_t num = ESPUI.addControl( ControlType::Number, "Channel ID CAN: Rear RPM", String( steerConfig.qogChannelIdCanRearPtoRpm ), ControlColor::Peterriver, tab,
          []( Control * control, int id ) {
            steerConfig.qogChannelIdCanRearPtoRpm = control->value.toInt();
          } );
          ESPUI.addControl( ControlType::Min, "Min", "0", ControlColor::Peterriver, num );
          ESPUI.addControl( ControlType::Max, "Max", "65535", ControlColor::Peterriver, num );
          ESPUI.addControl( ControlType::Step, "Step", "1", ControlColor::Peterriver, num );
        }
        {
          uint16_t num = ESPUI.addControl( ControlType::Number, "Channel ID CAN: Front RPM", String( steerConfig.qogChannelIdCanFrontPtoRpm ), ControlColor::Peterriver, tab,
          []( Control * control, int id ) {
            steerConfig.qogChannelIdCanFrontPtoRpm = control->value.toInt();
          } );
          ESPUI.addControl( ControlType::Min, "Min", "0", ControlColor::Peterriver, num );
          ESPUI.addControl( ControlType::Max, "Max", "65535", ControlColor::Peterriver, num );
          ESPUI.addControl( ControlType::Step, "Step", "1", ControlColor::Peterriver, num );
        }
        {
          uint16_t num = ESPUI.addControl( ControlType::Number, "Channel ID CAN: Motor RPM", String( steerConfig.qogChannelIdCanMotorRpm ), ControlColor::Peterriver, tab,
          []( Control * control, int id ) {
            steerConfig.qogChannelIdCanMotorRpm = control->value.toInt();
          } );
          ESPUI.addControl( ControlType::Min, "Min", "0", ControlColor::Peterriver, num );
          ESPUI.addControl( ControlType::Max, "Max", "65535", ControlColor::Peterriver, num );
          ESPUI.addControl( ControlType::Step, "Step", "1", ControlColor::Peterriver, num );
        }
        {
          uint16_t num = ESPUI.addControl( ControlType::Number, "Channel ID CAN: Wheel-based Speed", String( steerConfig.qogChannelIdCanWheelbasedSpeed ), ControlColor::Peterriver, tab,
          []( Control * control, int id ) {
            steerConfig.qogChannelIdCanWheelbasedSpeed = control->value.toInt();
          } );
          ESPUI.addControl( ControlType::Min, "Min", "0", ControlColor::Peterriver, num );
          ESPUI.addControl( ControlType::Max, "Max", "65535", ControlColor::Peterriver, num );
          ESPUI.addControl( ControlType::Step, "Step", "1", ControlColor::Peterriver, num );
        }
      }
    }
  }

  // Default Configurations Tab
  {
    uint16_t tab = ESPUI.addControl( ControlType::Tab, "Configurations", "Configurations" );
    ESPUI.addControl( ControlType::Label, "Attention:", "These Buttons here reset the whole config. This affects the WIFI too, if not configured otherwise below. You have to press \"Apply & Reboot\" above to actualy store them.", ControlColor::Carrot, tab );

